&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Анонимный))
	Тогда
		НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторСеанса");
		НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовЭлементОтбора.Использование = Истина;
		НовЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ИдентификаторСеанса;
	Иначе
		Если (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Игрок))
		Тогда
			НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			НовЭлементОтбора.Использование = Истина;
			НовЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.Игрок;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры