

&НаКлиенте
Процедура МероприятиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	МероприятиеОбработкаВыбораНаСервере(ВыбранноеЗначение);
//	Для каждого Исход из Список Цикл
//		ЭтаФорма.Элементы.Исходы.ДобавитьСтроку();
//		Строка = ЭтаФорма.Элементы.Исходы.ТекущиеДанные;
//		Строка.Исход = Исход.Значение;
//		Строка.Верный = Ложь;	
//		Сообщить(Строка.Исход.Наименование);
//	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура МероприятиеОбработкаВыбораНаСервере(Мероприятие)
	Запрос = новый Запрос;
	Запрос.Текст = "Выбрать
	|	Ссылка
	|из 
	|	Справочник.Исходы как Исходы
	|где
	|	Мероприятие = &Мероприятие";
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Исход = Запрос.Выполнить().Выбрать();
//	Результат = Новый СписокЗначений();

	Табл = ЭтаФорма.РеквизитФормыВЗначение("Объект.Исходы");
	Табл.Очистить();
	Пока Исход.Следующий() Цикл
		Строка = Табл.Добавить();
//		Результат.Добавить(Исход.Ссылка);
		Строка.Исход = Исход.Ссылка;
		Строка.Верный = Ложь;
	КонецЦикла;
	Сообщить(Табл);
	ЭтаФорма.ЗначениеВРеквизитФормы(Табл, "Объект.Исходы");
//	Возврат Результат;
КонецПроцедуры

