&НаКлиенте
Процедура МероприятиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МероприятиеНачалоВыбораНаСервере(ДанныеВыбора);
КонецПроцедуры

&НаСервере
Процедура МероприятиеНачалоВыбораНаСервере(ДанныеВыбора)
	ДанныеВыбора = Новый СписокЗначений();
	
	Запрос = новый Запрос();
	Запрос.Текст = "Выбрать
	|Мероприятие.Ссылка,
	|Мероприятие.Наименование
	|Из
	|Справочник.Мероприятия как Мероприятие
	|Где
	|Мероприятие.Завершено = Ложь";
	Мероприятие = Запрос.Выполнить().Выбрать();
	Пока Мероприятие.Следующий() Цикл
		ДанныеВыбора.Добавить(Мероприятие.Ссылка, Мероприятие.Наименование);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИсходНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИсходНачалоВыбораНаСервере(ДанныеВыбора);
КонецПроцедуры

&НаСервере
Процедура ИсходНачалоВыбораНаСервере(ДанныеВыбора)
	ДанныеВыбора = Новый СписокЗначений();
	
	Запрос = новый Запрос();
	Запрос.Текст = "Выбрать
	|Исход.Ссылка,
	|Исход.Наименование
	|Из
	|Справочник.Исходы как Исход
	|Где
	|Исход.Дата > &ТекущаяДата И Исход.Мероприятие = &Мероприятие";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Мероприятие", ЭтотОбъект.Объект.Мероприятие);
	Исход = Запрос.Выполнить().Выбрать();
	Пока Исход.Следующий() Цикл
		ДанныеВыбора.Добавить(Исход.Ссылка, Исход.Наименование);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Мероприятие.Завершено
	Тогда
		Отказ = Истина;
		Сообщить("Нельзя поставить назавершенное мероприятие");
	Иначе
		Если ТекущийОбъект.Исход.Мероприятие <> ТекущийОбъект.Мероприятие
		Тогда
			Отказ = Истина;
			Сообщить("Исход не из выбранного мероприятия");
		Иначе
			Если ТекущийОбъект.Исход.Дата < ТекущаяДата()
			Тогда
				Отказ = Истина;
				Сообщить("Время ставки на исход прошло");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МероприятиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	МероприятиеОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура МероприятиеОбработкаВыбораНаСервере(ВыбранноеЗначение)
	Объект.Исход = Справочники.Исходы.НайтиПоРеквизиту("Мероприятие", ВыбранноеЗначение);
КонецПроцедуры


&НаКлиенте
Процедура ИгрокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИгрокНачалоВыбораНаСервере(ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ИгрокНачалоВыбораНаСервере(ДанныеВыбора, СтандартнаяОбработка)
	Если (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Игрок))
	Тогда
		ДанныеВыбора = Новый СписокЗначений();
		ДанныеВыбора.Добавить(ПараметрыСеанса.Игрок);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Игрок))
	Тогда
		Объект.Игрок = ПараметрыСеанса.Игрок;
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусСтавки.Записано");
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура();
	Если (Параметры.Свойство("ЗначенияЗаполнения", ДанныеЗаполнения))
	Тогда
		ДанныеЗаполнения.Свойство("Мероприятие", ЭтаФорма.Объект.Мероприятие);
		ДанныеЗаполнения.Свойство("Исход", ЭтаФорма.Объект.Исход);
	КонецЕсли;
КонецПроцедуры