Процедура ОбработкаПроведения(Отказ, Режим)
	Если СтавкаВозможна()
	Тогда
		Движения.Депозиты.Записывать = Истина;
		Движение = Движения.Депозиты.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Игрок = Игрок;
		Движение.Сумма = 0;
		Движение.СуммаРезерва = Сумма;
		
		ЭтотОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусСтавки.Принято");
		ЭтотОбъект.Записать();
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция СтавкаВозможна()
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Игрок", Игрок);
	
	Депозиты = РегистрыНакопления.Депозиты.Выбрать(,,ПараметрыОтбора,);
	ЗапросыНаСнятие = РегистрыНакопления.ЗапросНаСнятие.Выбрать(,,ПараметрыОтбора,);
	ДоступнаяСумма = 0;
	
	Пока Депозиты.Следующий() Цикл
		Если Депозиты.ВидДвижения = ВидДвиженияНакопления.Приход
		Тогда
			ДоступнаяСумма = ДоступнаяСумма + Депозиты.Сумма - Депозиты.СуммаРезерва;
		Иначе
			ДоступнаяСумма = ДоступнаяСумма - Депозиты.Сумма + Депозиты.СуммаРезерва;
		КонецЕсли;
	КонецЦикла;
	
	
	Пока ЗапросыНаСнятие.Следующий() Цикл
		Если ЗапросыНаСнятие.ВидДвижения = ВидДвиженияНакопления.Приход
		Тогда
			ДоступнаяСумма = ДоступнаяСумма - ЗапросыНаСнятие.Сумма;
		Иначе
			ДоступнаяСумма = ДоступнаяСумма + ЗапросыНаСнятие.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступнаяСумма < Сумма
	Тогда
		Сообщить("Недостаточно средств в депозите");
		Возврат Ложь;
	КонецЕсли;
	
	Если Мероприятие.Завершено
	Тогда
		Сообщить("Мероприятие завершено");
		Возврат Ложь;
	КонецЕсли;
	
	Если Исход.Дата < ТекущаяДата()
	Тогда
		Сообщить("Время ставки на исход прошло");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции