Процедура ОбработкаПроведения(Отказ, Режим)
	Депозит = РегистрыНакопления.Депозиты.Остатки().Итог("Сумма");
	Резерв = РегистрыНакопления.Депозиты.Остатки().Итог("СуммаРезерва");
	Если Депозит - Резерв < Сумма
	Тогда
		Отказ = Истина;
		Сообщить("Недостаточно средств в депозите")
	Иначе
		Движения.Депозиты.Записывать = Истина;
		Движение = Движения.Депозиты.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Игрок = Игрок;
		Движение.Сумма = 0;
		Движение.СуммаРезерва = Сумма;
	КонецЕсли;
КонецПроцедуры