Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ОтправитьСсылку(Отказ);
	
	Если не Отказ тогда
		Движения.ЗапросНаПополнение.Записывать = Истина;
		Движение = Движения.ЗапросНаПополнение.ДобавитьПриход();
		Движение.Игрок = Игрок;
		Движение.Сумма = СуммаПлатежа;
		Движение.Период = Дата;
		
		Документ = Документы.ПополнениеДепозита.СоздатьДокумент();
		Документ.ЗапросНаПополнение = Ссылка;
		Документ.Статус = ПредопределенноеЗначение("Перечисление.СтатусПлатежа.НаРассмотрении");
		Документ.Дата = Дата;
		Документ.Записать();
		
		ЭтотОбъект.ПополнениеДепозита = Документ.Ссылка;
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОтправитьСсылку(Отказ)
	Профиль = Новый ИнтернетПочтовыйПрофиль();
	Профиль.АдресСервераSMTP = "smtp.gmail.com";		
	Профиль.ПользовательSMTP = "sayahov1998@gmail.com";
	Профиль.ПарольSMTP = "EnigmaCode";
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
		
	Сообщение = Новый ИнтернетПочтовоеСообщение();
	Сообщение.Отправитель = "sayahov1998@gmail.com";
	Сообщение.Тема = "Пополнение депозита";
	Сообщение.Получатели.Добавить(Игрок.ЭлектроннаяПочта);
	Сообщение.Тексты.Добавить("Ссылка на оплату счета на " + СуммаПлатежа + " руб. номер " + Номер);
		
	Почта = Новый ИнтернетПочта();
	Попытка 
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
		Сообщить("На почтовый адрес " + Игрок.ЭлектроннаяПочта + " отправлена ссылка для оплаты");
	Исключение
		Сообщить(""+ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры
