

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Логин = ТекущийОбъект.Наименование;
	Если не ПользователиИнформационнойБазы.НайтиПоИмени(Логин) = Неопределено
	Тогда
		Сообщить("Пользователь с таким логином существует");
		Отказ = Истина;
	Иначе
		ДобавитьПользователя(ТекущийОбъект)
	КонецЕсли
КонецПроцедуры

Процедура ДобавитьПользователя(Пользователь)
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользователь.Имя = Пользователь.Наименование;
	НовыйПользователь.Пароль = Пользователь.Пароль;
	НовыйПользователь.ПолноеИмя = Пользователь.Фамилия + " " + Пользователь.Имя + " " + Пользователь.Отчество;
	НовыйПользователь.Роли.Добавить(Метаданные.Роли.Игрок);
	НовыйПользователь.Записать();
КонецПроцедуры


