Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Игрок", Игрок);
	
	Депозиты = РегистрыНакопления.Депозиты.Выбрать(,,ПараметрыОтбора,);
	ЗапросыНаСнятие = РегистрыНакопления.ЗапросНаСнятие.Выбрать(,,ПараметрыОтбора,);
	ДоступнаяСумма = 0;
	
	Пока Депозиты.Следующий() Цикл
		Если Депозиты.ВидДвижения = ВидДвиженияНакопления.Приход
		Тогда
			ДоступнаяСумма = ДоступнаяСумма + Депозиты.Сумма - Депозиты.СуммаРезерва;
		Иначе
			ДоступнаяСумма = ДоступнаяСумма - Депозиты.Сумма + Депозиты.СуммаРезерва;
		КонецЕсли;
	КонецЦикла;
	
	
	Пока ЗапросыНаСнятие.Следующий() Цикл
		Если ЗапросыНаСнятие.ВидДвижения = ВидДвиженияНакопления.Приход
		Тогда
			ДоступнаяСумма = ДоступнаяСумма - ЗапросыНаСнятие.Сумма;
		Иначе
			ДоступнаяСумма = ДоступнаяСумма + ЗапросыНаСнятие.Сумма;
		КонецЕсли;
	КонецЦикла;
		
	Если СуммаСнятия > ДоступнаяСумма Тогда
		Отказ = Истина;
		Сообщить("Недостаточно средств");
	Иначе
		Движения.ЗапросНаСнятие.Записывать = Истина;
		Движение = Движения.ЗапросНаСнятие.ДобавитьПриход();
		Движение.Игрок = Игрок;
		Движение.Сумма = СуммаСнятия;
		Движение.Период = Дата;
		
		Документ = Документы.СнятиеСДепозита.СоздатьДокумент();
		Документ.ЗапросНаСнятие = Ссылка;
		Документ.Статус = ПредопределенноеЗначение("Перечисление.СтатусПлатежа.НаРассмотрении");
		Документ.Дата = Дата;
		Документ.Записать();
		
		ЭтотОбъект.СнятиеСДепозита = Документ.Ссылка;
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

