&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Мероприятие.Завершено
	Тогда
		Отказ = Истина;
		Сообщить("Нельзя добавить или изменить исход завершенного мероприятия")
	Иначе
		Если ТекущийОбъект.Дата < ТекущийОбъект.Мероприятие.ДатаНачала 
		Тогда
			Отказ = Истина;
			Сообщить("ДатаНачала исхода не может быть раньше даты начала мероприятия");
		КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СделатьСтавку(Команда)
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Мероприятие",
	 ЭтаФорма.Объект.Мероприятие);
	 ПараметрыЗаполнения.Вставить("Исход",
	 ЭтаФорма.Объект.Ссылка);
 
 	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
 	
	ОткрытьФорму("Документ.Ставка.Форма.Создать", ПараметрыФормы);	
КонецПроцедуры


&НаКлиенте
Процедура МероприятиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	МероприятиеОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура МероприятиеОбработкаВыбораНаСервере(ВыбранноеЗначение)
	ЭтотОбъект.Объект.ДатаНачала = ВыбранноеЗначение.ДатаНачала;
КонецПроцедуры

&НаКлиенте
Процедура МероприятиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МероприятиеНачалоВыбораНаСервере(ДанныеВыбора);
КонецПроцедуры

&НаСервере
Процедура МероприятиеНачалоВыбораНаСервере(ДанныеВыбора)
	ДанныеВыбора = Новый СписокЗначений();
	
	Запрос = новый Запрос();
	Запрос.Текст = "Выбрать
	|Мероприятие.Ссылка,
	|Мероприятие.Наименование
	|Из
	|Справочник.Мероприятия как Мероприятие
	|Где
	|Мероприятие.Завершено = Ложь";
	Мероприятие = Запрос.Выполнить().Выбрать();
	
	Пока Мероприятие.Следующий() Цикл
		ДанныеВыбора.Добавить(Мероприятие.Ссылка, Мероприятие.Наименование);
	КонецЦикла;
КонецПроцедуры



