Процедура ОбработкаПроведения(Отказ, Режим)
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусПлатежа.Отменен")
	Тогда
		Если СтрДлина(Комментарий) < 1
		Тогда
			Сообщить("Комментарий не заполнен");
			Отказ = Истина;
		КонецЕсли;
		ДвижениеЗапросСнятие();
	Иначе
		Если Статус = ПредопределенноеЗначение("Перечисление.СтатусПлатежа.НаРассмотрении")
		Тогда
			Сообщить("Неверный статус");
			Отказ = Истина;
		Иначе
			ДвижениеЗапросСнятие();
	
			Движения.Депозиты.Записывать = Истина;
			Движение = Движения.Депозиты.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Сумма = ЗапросНаПополнение.СуммаПлатежа;
			Движение.Игрок = ЗапросНаПополнение.Игрок;
	
			ОтправитьЧекНаПочту(Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДвижениеЗапросСнятие()
	Движения.ЗапросНаПополнение.Записывать = Истина;
	Движение = Движения.ЗапросНаПополнение.ДобавитьРасход();
	Движение.Игрок = ЗапросНаПополнение.Игрок;
	Движение.Сумма = ЗапросНаПополнение.СуммаПлатежа;
	Движение.Период = Дата;
КонецПроцедуры

Процедура ОтправитьЧекНаПочту(Отказ)
	Профиль = Новый ИнтернетПочтовыйПрофиль();
	Профиль.АдресСервераSMTP = "smtp.gmail.com";		
	Профиль.ПользовательSMTP = "sayahov1998@gmail.com";
	Профиль.ПарольSMTP = "EnigmaCode";
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
		
	Сообщение = Новый ИнтернетПочтовоеСообщение();
	Сообщение.Отправитель = "sayahov1998@gmail.com";
	Сообщение.Тема = "Пополнение депозита";
	Сообщение.Получатели.Добавить(ЗапросНаПополнение.Игрок.ЭлектроннаяПочта);
	Сообщение.Тексты.Добавить("Чек оплаты на сумму " + ЗапросНаПополнение.СуммаПлатежа + " руб. номер " + Номер);
		
	Почта = Новый ИнтернетПочта();
	Попытка 
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
		Сообщить("На почтовый адрес " + ЗапросНаПополнение.Игрок.ЭлектроннаяПочта + " отправлена ссылка для оплаты");
	Исключение
		Сообщить(""+ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры

