Процедура ОбработкаПроведения(Отказ, Режим)
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусПлатежа.Отменен")
	Тогда
		Если СтрДлина(Комментарий) < 1
		Тогда
			Сообщить("Комментарий не заполнен");
			Отказ = Истина;
		КонецЕсли;
		ДвижениеЗапросНаСнятие();
	Иначе
		Если Статус = ПредопределенноеЗначение("Перечисление.СтатусПлатежа.НаРассмотрении")
		Тогда
			Сообщить("Неверный статус");
			Отказ = Истина;
		Иначе
			ДвижениеЗапросНаСнятие();
	
			Движения.Депозиты.Записывать = Истина;
			Движение = Движения.Депозиты.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Сумма = ЗапросНаСнятие.СуммаСнятия;
			Движение.Игрок = ЗапросНаСнятие.Игрок;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДвижениеЗапросНаСнятие()
	Движения.ЗапросНаСнятие.Записывать = Истина;
	Движение = Движения.ЗапросНаСнятие.ДобавитьРасход();
	Движение.Игрок = ЗапросНаСнятие.Игрок;
	Движение.Сумма = ЗапросНаСнятие.СуммаСнятия;
	Движение.Период = Дата;
КонецПроцедуры