

&НаКлиенте
Процедура ИгрокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИгрокНачалоВыбораНаСервере(ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ИгрокНачалоВыбораНаСервере(ДанныеВыбора, СтандартнаяОбработка)
	Если (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Игрок))
	Тогда
		ДанныеВыбора = Новый СписокЗначений();
		ДанныеВыбора.Добавить(ПараметрыСеанса.Игрок);
		СтандартнаяОбработка = Ложь;
		ЭтаФорма.Объект.Игрок = ПараметрыСеанса.Игрок;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Игрок))
	Тогда
		Объект.Игрок = ПараметрыСеанса.Игрок;
	КонецЕсли;
КонецПроцедуры

