&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ДатаНачала < ТекущаяДата()
	Тогда
		Отказ = Истина;
		Сообщить("ДатаНачала мероприятия не может быть раньше текущей");
	КонецЕсли;
	Если не Параметры.Ключ.Пустая() и не Отказ
	Тогда
		РазницаДаты = ТекущийОбъект.ДатаНачала - Параметры.Ключ.ДатаНачала;
		
		Запрос = новый Запрос();
		Запрос.Текст = "Выбрать
		|Исход.Ссылка
		|Из
		|Справочник.Исходы как Исход
		|Где
		|Исход.Мероприятие = &Мероприятие";
		Запрос.УстановитьПараметр("Мероприятие", Параметры.Ключ);
		Исход = Запрос.Выполнить().Выбрать();
		Пока Исход.Следующий() Цикл
			ОбъектИсход = Исход.Ссылка.ПолучитьОбъект();
			ОбъектИсход.Дата = ОбъектИсход.Дата + РазницаДаты;
			ОбъектИсход.Записать();
		КонецЦикла;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаИсходовМероприятия(Команда)
	Мероприятие = ЭтаФорма.Объект.Ссылка;
	
	ЗначениеОтбора = Новый Структура("Мероприятие", Мероприятие);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);

	ОткрытьФорму("Справочник.Исходы.Форма.ФормаСписка", ПараметрыФормы);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Ключ.Пустая() и Параметры.Ключ.Завершено
	Тогда
		ЭтотОбъект.ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры


