Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Депозиты.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать
	|	Ставка.Игрок,
	|	Ставка.Исход,
	|	Ставка.Сумма
	|Из
	|	Документ.Ставка как Ставка
	|Где
	|	Ставка.Мероприятие = &Мероприятие и
	|	Ставка.Проведен = Истина
	|";
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Ставки = Запрос.Выполнить().Выбрать();
	
	Пока Ставки.Следующий() Цикл
		Строка = Исходы.Найти(Ставки.Исход, "Исход");
		Если Строка.Верный
		Тогда
			Движение = Движения.Депозиты.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Игрок = Ставки.Игрок;
			Движение.Сумма = Ставки.Сумма * Строка.Исход.Коэффициент;
		КонецЕсли
	КонецЦикла;
КонецПроцедуры