Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Депозиты.Записывать = Истина;
	Движения.Ставки.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать
	|	Ставка.Ссылка,
	|	Ставка.Игрок,
	|	Ставка.Исход,
	|	Ставка.Сумма
	|Из
	|	Документ.Ставка как Ставка
	|Где
	|	Ставка.Мероприятие = &Мероприятие и
	|	Ставка.Проведен = Истина
	|";
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Ставки = Запрос.Выполнить().Выбрать();
	
	МероприятиеОбъект = Мероприятие.ПолучитьОбъект();
	МероприятиеОбъект.Завершено = Истина;
	МероприятиеОбъект.Записать();
	
	Пока Ставки.Следующий() Цикл
		Строка = Исходы.Найти(Ставки.Исход, "Исход");
		Движение = Движения.Депозиты.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Игрок = Ставки.Игрок;
		Движение.Сумма = Ставки.Сумма;
		Движение.СуммаРезерва = Ставки.Сумма;
		Если Строка.Верный
		Тогда
			Движение = Движения.Депозиты.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Игрок = Ставки.Игрок;
			Движение.Сумма = Ставки.Сумма * Строка.Исход.Коэффициент;
			Движение.СуммаРезерва = 0;
			
			Движение = Движения.Ставки.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Игрок = Ставки.Игрок;
			Движение.Ставка = Ставки.Ссылка;
			Движение.Сумма = Ставки.Сумма * (Строка.Исход.Коэффициент - 1);
			
			Ставка = Ставки.Ссылка.ПолучитьОбъект();
			Ставка.Статус = ПредопределенноеЗначение("Перечисление.СтатусСтавки.Выиграно");
			Ставка.Записать();
		Иначе
			Движение = Движения.Ставки.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Игрок = Ставки.Игрок;
			Движение.Ставка = Ставки.Ссылка;
			Движение.Сумма = Ставки.Сумма;
			
			Ставка = Ставки.Ссылка.ПолучитьОбъект();
			Ставка.Статус = ПредопределенноеЗначение("Перечисление.СтатусСтавки.Проиграно");
			Ставка.Записать();
		КонецЕсли
		
	КонецЦикла;
КонецПроцедуры